### NOTES ON PANDAS

### INSTALLING PANDAS

In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.22.4 in c:\users\dell\anaconda3\envs\myenv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\envs\myenv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.3-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\envs\myenv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp310-cp310-win_amd64.whl (11.3 MB)
   ---------------------------------------- 0.0/11.3 MB ? eta -:--:--
   ---------------------------------------- 0.0/11.3 MB ? eta -:--:--
    --------------------------------------- 0.3/11.3 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.3 MB 1.1 MB/s eta 0:00:10
   -- ------------------------------------- 0.8/11.3 MB 1.0 MB/s eta 0:00:11
   --- ------------------------------------ 1.0/11.3 MB 1.1 MB/s eta 0:00:10
   ---- ----------------------------------- 1.3/11.3 MB 1.2 MB/s eta 0:00:09
   ------ --------------------------------- 1.8/11.3 MB 1.3 MB/s eta 0:00:08
   -------- ------------------------------- 2.4/11.3 MB 1.5 MB/s eta 0:00:07
   ---------- ----------------------------- 2.9/11.3 MB 1.6 MB/s eta 0:00:06
   ----------- ---------------------------- 3.1/11.3 MB 1.6 MB/s eta 0:00:06
   ------------- -------------------------- 3.9/11.3 MB 1.7 MB/s eta 0:00:05
   ---------------- ----------------------- 4.7/11.3 MB 1.9 MB/s eta 0:00:04
   ------------------ --------------------- 5.2/11.3 MB 2.0 MB/s eta 0:00:04
   -------------------- ------------------- 5.8/11.3 MB 2.0 MB/s eta 0:00:03
   ---------------------- ----------------- 6.3/11.3 MB 2.1 MB/s eta 0:00:03
   ------------------------- -------------- 7.3/11.3 MB 2.2 MB/s eta 0:00:02
   -------------------------- ------------- 7.6/11.3 MB 2.2 MB/s eta 0:00:02
   ------------------------------ --------- 8.7/11.3 MB 2.3 MB/s eta 0:00:02
   -------------------------------- ------- 9.2/11.3 MB 2.4 MB/s eta 0:00:01
   ------------------------------------ --- 10.2/11.3 MB 2.5 MB/s eta 0:00:01
   ------------------------------------- -- 10.7/11.3 MB 2.5 MB/s eta 0:00:01
   ---------------------------------------- 11.3/11.3 MB 2.5 MB/s  0:00:04
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.3-py2.py3-none-any.whl (348 kB)
Installing collected packages: pytz, tzdata, pandas

   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ---------------------------------------- 0/3 [pytz]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   ------------- -------------------------- 1/3 [tzdata]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   -------------------------- ------------- 2/3 [pandas]
   ---------------------------------------- 3/3 [pandas]

Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.3
Note: you may need to restart the kernel to use updated packages.

In [1]:
#importing pandas 
import pandas as pd

In [5]:
pd.__version__

'2.3.3'

In [11]:
#creating a dataframe
df=pd.DataFrame([11,22,33,44,55,66],columns=["S.No"] )
print(df)

   S.No
0    11
1    22
2    33
3    44
4    55
5    66

In [12]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [5]:
data = {
    
        'Name':["priya","riya","Sriya","moni","kiran"],
        'Age':[28,19,25,18,20],
        'Salary':[20000,30000,25000,45000,60000]
}
    

print(data)

{'Name': ['priya', 'riya', 'Sriya', 'moni', 'kiran'], 'Age': [28, 19, 25, 18, 20], 'Salary': [20000, 30000, 25000, 45000, 60000]}

In [6]:
df=pd.DataFrame(data)
print(df)

    Name  Age  Salary
0  priya   28   20000
1   riya   19   30000
2  Sriya   25   25000
3   moni   18   45000
4  kiran   20   60000

In [ ]:
# accessing the  of top 2 rows of dataframe
df.head(2) #by default it will print top 5 rows

    Name  Age  Salary
0  priya   28   20000
1   riya   19   30000

In [ ]:
# accessing the  of bottom 2 rows of dataframe
df.tail(2) #by default it will print bottom 5 rows

    Name  Age  Salary
3   moni   18   45000
4  kiran   20   60000

In [31]:
df.shape

(5, 3)

In [32]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [7]:
df.rename(columns={'Salary':'monthly_salary'},inplace=True)
df

    Name  Age  monthly_salary
0  priya   28           20000
1   riya   19           30000
2  Sriya   25           25000
3   moni   18           45000
4  kiran   20           60000

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            5 non-null      object
 1   Age             5 non-null      int64
 2   monthly_salary  5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 248.0+ bytes

In [42]:
df.describe()

             Age  monthly_salary
count   5.000000        5.000000
mean   22.000000    36000.000000
std     4.301163    16355.427234
min    18.000000    20000.000000
25%    19.000000    25000.000000
50%    20.000000    30000.000000
75%    25.000000    45000.000000
max    28.000000    60000.000000

In [ ]:
#save and load csv
df.to_csv('Test.csv',index=False)  #export dataframe

In [ ]:
pd.read_csv('Test.csv') #import dataframe

    Name  Age  monthly_salary
0  priya   28           20000
1   riya   19           30000
2  Sriya   25           25000
3   moni   18           45000
4  kiran   20           60000

#rows and columns selection

In [50]:
#columns selection
df[["Name"]]  #single column

    Name
0  priya
1   riya
2  Sriya
3   moni
4  kiran

In [51]:
df[["Age","monthly_salary"]] #multiple columns

   Age  monthly_salary
0   28           20000
1   19           30000
2   25           25000
3   18           45000
4   20           60000

# selecting rows

In [ ]:
#loc - label based indexing
df.loc[df.Name=='kiran']

    Name  Age  monthly_salary
4  kiran   20           60000

In [64]:
df.loc[(df.Name=="priya") & (df.monthly_salary>=10000)]

    Name  Age  monthly_salary
0  priya   28           20000

In [71]:
df.loc[0:3]

    Name  Age  monthly_salary
0  priya   28           20000
1   riya   19           30000
2  Sriya   25           25000
3   moni   18           45000

# iloc- index-value based

In [65]:
df.iloc[0]

Name              priya
Age                  28
monthly_salary    20000
Name: 0, dtype: object

In [69]:
df.iloc[0][2]

C:\Users\DELL\AppData\Local\Temp\ipykernel_3060\2519637664.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][2]

np.int64(20000)

In [70]:
df.iloc[0:3]

    Name  Age  monthly_salary
0  priya   28           20000
1   riya   19           30000
2  Sriya   25           25000

# Filter DataFrame

In [75]:
df['Age']>20

0     True
1    False
2     True
3    False
4    False
Name: Age, dtype: bool

In [76]:
df[df['Age']>20]

    Name  Age  monthly_salary
0  priya   28           20000
2  Sriya   25           25000

In [77]:
age_filter=df[df['Age']>20]
age_filter

    Name  Age  monthly_salary
0  priya   28           20000
2  Sriya   25           25000

In [78]:
df[(df['Age'] >= 18) & (df['monthly_salary'] >= 50000)] # multiple filter conditions

    Name  Age  monthly_salary
4  kiran   20           60000

In [82]:
df.where(df['Age'] > 18) # where function replace values in a DataFrame based on a condition

    Name   Age  monthly_salary
0  priya  28.0         20000.0
1   riya  19.0         30000.0
2  Sriya  25.0         25000.0
3    NaN   NaN             NaN
4  kiran  20.0         60000.0

In [8]:
df.where(df['Age'] > 18,other="Not Eligible")

           Name           Age monthly_salary
0         priya            28          20000
1          riya            19          30000
2         Sriya            25          25000
3  Not Eligible  Not Eligible   Not Eligible
4         kiran            20          60000

# Rows and Columns - Operation (Add, update, delete)

In [11]:
# Create a new column
df['Team']=['CEO', 'HR', 'CTO', 'DA', 'SDE']
df

    Name  Age  monthly_salary Team
0  priya   28           20000  CEO
1   riya   19           30000   HR
2  Sriya   25           25000  CTO
3   moni   18           45000   DA
4  kiran   20           60000  SDE

In [43]:
# Add new columns using existing column/s
df['Bonus']=df['monthly_salary']*1.5
df

    Name  Age  monthly_salary Team     Bonus
0  priya   28           95000  CEO  142500.0
1   riya   19           30000   HR   45000.0
2  Sriya   25           25000  CTO   37500.0
3   moni   18           45000   DA   67500.0
4  kiran   20           60000  SDE   90000.0

In [26]:
df.loc[len(df)]=['sus',25,34000,'SDE1',(34000*1.5)] # adding new row to dataframe

In [48]:
df.drop(df[df.Name=='sus'].index,inplace=True) # deleting a row from dataframe

In [46]:
df

    Name  Age  monthly_salary Team     Bonus
0  priya   28          100000  CEO  142500.0
1   riya   19           30000   HR   45000.0
2  Sriya   25           25000  CTO   37500.0
3   moni   18           45000   DA   67500.0
4  kiran   20           60000  SDE   90000.0

In [45]:
#Update a value using index in dataframe
df.loc[0,'monthly_salary'] = 100000
df

    Name  Age  monthly_salary Team     Bonus
0  priya   28          100000  CEO  142500.0
1   riya   19           30000   HR   45000.0
2  Sriya   25           25000  CTO   37500.0
3   moni   18           45000   DA   67500.0
4  kiran   20           60000  SDE   90000.0

In [ ]:
#update value using column name
df.loc[df.Name=='priya','monthly_salary']=95000
df

    Name  Age  monthly_salary Team     Bonus
0  priya   28           95000  CEO  142500.0
1   riya   19           30000   HR   45000.0
2  Sriya   25           25000  CTO   37500.0
3   moni   18           45000   DA   67500.0
4  kiran   20           60000  SDE   90000.0

In [ ]:
#dropping a column
df.drop('Bonus',axis=0,inplace=True)
#del multiple columns
#df.drop(['Bonus','Team'],axis=0,inplace=True)

    Name  Age  monthly_salary Team
0  priya   28           95000  CEO
1   riya   19           30000   HR
2  Sriya   25           25000  CTO
3   moni   18           45000   DA
4  kiran   20           60000  SDE

In [ ]:
df.drop(1,axis=0) #can use inplace=True to make changes permanent

    Name  Age  monthly_salary Team     Bonus
0  priya   28          100000  CEO  142500.0
2  Sriya   25           25000  CTO   37500.0
3   moni   18           45000   DA   67500.0
4  kiran   20           60000  SDE   90000.0

In [51]:
df

    Name  Age  monthly_salary Team     Bonus
0  priya   28          100000  CEO  142500.0
1   riya   19           30000   HR   45000.0
2  Sriya   25           25000  CTO   37500.0
3   moni   18           45000   DA   67500.0
4  kiran   20           60000  SDE   90000.0

In [53]:
#sorting a dataframe
df.sort_values('monthly_salary',ascending=False) #sort by monthly_salary in descending order

    Name  Age  monthly_salary Team     Bonus
0  priya   28          100000  CEO  142500.0
4  kiran   20           60000  SDE   90000.0
3   moni   18           45000   DA   67500.0
1   riya   19           30000   HR   45000.0
2  Sriya   25           25000  CTO   37500.0

In [54]:
#working with datetime
df['Joining_date']=['2020-01-15','2019-03-20','2021-07-10','2018-11-05','2022-02-25']
df

    Name  Age  monthly_salary Team     Bonus Joining_date
0  priya   28          100000  CEO  142500.0   2020-01-15
1   riya   19           30000   HR   45000.0   2019-03-20
2  Sriya   25           25000  CTO   37500.0   2021-07-10
3   moni   18           45000   DA   67500.0   2018-11-05
4  kiran   20           60000  SDE   90000.0   2022-02-25